content/main/20211011014207-review_machine.md
+++
title = "Review Machine"
author = ["System Administrator"]
draft = false
+++

This machine is for review of everything worth look back on in a 1d, 7d, 14d, 30d cycle.


## Flow {#flow}


### 1. Record {#1-dot-record}

Record the content worth reviewing by hitting `C-c c (org-capture)` and `r(review)`.
Record the summary and resource/notes for review.
Records would be kept in  `OrgNotes/Review.org`


### 2. Review {#2-dot-review}

Go to `OrgNotes/Review.org`, and run command `org-review`[^fn:1]. A sparse tree showing the items would be automatically generated.
The log of the reviewing should be done seperately in every entry (C-c C-x i/o)

[^fn:1]: : a self written function taking advantage of the `date` shell command and `datetree` option in org-capture.